#+OPTIONS:   H:4 toc:nil author:nil timestamp:nil
#+TITLE: Terra, Brawler 1/Hunter 2
* Details
| Name      | Terra                    |
| Alignment | Neutral                  |
| Lv        | Brawler 1/Hunter 2       |
| Deity     | Pharasma, Lady of Graves |
| Race      | Human                    |
| Size      | Medium                   |
| Sex       | Female                   |
| Age       | 20                       |
| Height    | 5'4"                     |
| Weight    | 130lbs                   |
| Hair      | Green                    |
| Eyes      | Red                      |
| Language  | Common                   |

* Basics
|     | Attr | Modifier | Comment               |
|-----+------+----------+-----------------------|
| STR |   18 |        4 | Original 16, Human +2 |
| DEX |   14 |        2 |                       |
| CON |   14 |        2 |                       |
| INT |   10 |        0 |                       |
| WIS |   12 |        1 |                       |
| CHA |    8 |       -1 |                       |

- HP: 1d10+2d8+6(con)+2(favored class) = 27
- Speed: 20ft
- Init: 2(dex)

* Class
** Brawler (Wild Child) 1
- Brawler's Cunning: Int = 13 for the purpose of meeting the prerequesites of combat feats
- Martial Flexibility: 4/day, a brawler can take a move action to gain the benefit of a combat feat she does not possess.
- Unarmed Strike (1d6)
** Hunter 2
- Animal Focus (2 Min/Day on Self, Unlimited on Animal)
  Default Falcon Focus on Animal
  - Bat: The creature gains darkvision to a range of 60 feet.
  - Bear: The creature gains a +2 enhancement bonus to Constitution
  - Bull: The creature gains a +2 enhancement bonus to Strength
  - Falcon: The creature gains a +4 competence bonus on Perception checks
  - Frog: The creature gains a +4 competence bonus on Swim checks and on Acrobatics checks to jump
  - Monkey: The creature gains a +4 competence bonus on Climb checks
  - Mouse: The creature gains evasion, as the rogue class feature
  - Owl: The creature gains a +4 competence bonus on Stealth checks
  - Snake: The creature gains a +2 bonus on attack rolls when making attacks of opportunity and a +2 dodge bonus to AC against attacks of opportunity
  - Stag: The creature gains a 5-foot enhancement bonus to its base land speed
  - Tiger: The creature gains a +2 enhancement bonus to Dexterity
  - Wolf: The creature gains the scent ability with a range of 10 feet
- Wild Empathy
- Track
- Precise Companion: Outflank
* Offense
- Falchion: +7=+2(BAB)+4(STR)+1(MWK), 2d4+6/18-20x2
- Unarmed Strike: +6=+2(BAB)+4(STR), 1d6+4/20x2
- Longbow, Composite: +5=+2(BAB)+2(DEX)+1(MWK), 1d8+4/20x3

* Defense
- AC: 18 = 10 + 2(dex) + 6(breast plate), FF: 16, Touch: 12
- CMD: 10 +4(str) + 2(dex) + 2(BAB) = 18, FF CMD: 16
- Saving Throws
|        | Total | Base | Attribute | Item | Traits |
|--------+-------+------+-----------+------+--------|
| Fort   |     8 |    5 |         2 |    1 |        |
| Reflex |     8 |    5 |         2 |    1 |        |
| Will   |     3 |    0 |         1 |    1 |      1 |
* Skill
Skill Points = 4(Brawler)+12(Hunter)+3(Human)=19

| Name               | Total | Attribute | Rank | Misc | ACP |
|--------------------+-------+-----------+------+------+-----|
| Acrobatics*        |     5 | DEX 2     |    3 |    3 |  -3 |
| Appraise           |     0 | INT 0     |    0 |    0 |     |
| Bluff              |     2 | CHA -1    |    3 |    0 |     |
| Climb*             |     8 | STR 4     |    1 |    3 |   0 |
| Craft*             |     0 | INT 0     |    0 |    0 |     |
| Diplomacy          |    -1 | CHA -1    |    0 |    0 |     |
| Disable Device     |     2 | DEX 2     |    0 |    0 |  -3 |
| Disguise           |    -1 | CHA -1    |    0 |    0 |     |
| Escape Artist*     |    -1 | DEX 2     |    0 |    0 |  -3 |
| Fly                |    -1 | DEX 2     |    0 |    0 |  -3 |
| Handle Animal*     |     5 | CHA -1    |    3 |    3 |     |
| Heal*              |     1 | WIS 1     |    0 |    0 |     |
| Intimidate*        |    -1 | CHA -1    |    0 |    0 |     |
| K (Arcana)         |     0 | INT 0     |    0 |    0 |     |
| K (Dungeoneering)* |     0 | INT 0     |    0 |    0 |     |
| K (Engineering)    |     0 | INT 0     |    0 |    0 |     |
| K (Geography)      |     0 | INT 0     |    0 |    0 |     |
| K (History)        |     0 | INT 0     |    0 |    0 |     |
| K (Local)*         |     4 | INT 0     |    1 |    3 |     |
| K (Nature)*        |     4 | INT 0     |    1 |    3 |     |
| K (Nobility)       |     0 | INT 0     |    0 |    0 |     |
| K (Planes)         |     0 | INT 0     |    0 |    0 |     |
| K (Religion)       |     0 | INT 0     |    0 |    0 |     |
| Linguistics        |     0 | INT 0     |    0 |    0 |     |
| Perception*        |     7 | WIS 1     |    3 |    3 |     |
| Perform            |    -1 | CHA -1    |    0 |    0 |     |
| Profession*        |     1 | WIS 1     |    0 |    0 |     |
| Ride*              |     2 | DEX 2     |    0 |    0 |  -3 |
| Sense Motive*      |     5 | WIS 1     |    1 |    3 |     |
| Sleight of Hand    |     2 | DEX 2     |    0 |    0 |  -3 |
| Spellcraft*        |     0 | INT 0     |    0 |    0 |     |
| Stealth*           |     2 | DEX 2     |    0 |    0 |  -3 |
| Survival*          |     7 | WIS 1     |    3 |    3 |     |
| Swim*              |     4 | STR 4     |    0 |    0 |  -3 |
| Use Magic Device   |     0 | CHA -1    |    0 |    0 |     |
|--------------------+-------+-----------+------+------+-----|
| Total              |       |           |   19 |      |     |
#+TBLFM: @37$4=vsum(@2$4..@36$4)


- +4 handle animal for animal companion
- +2 perception and sense motive when adjacent to animal companion
* Feat and Traits
** Feat
| Level | Source                     | Feat                       | Description                         |
|     1 |                            | Combat Expertise           | +1 AC                               |
|     1 | Human                      | Power Attack               | -1 Attack, +3 Damage                |
|     1 | Brawler 1                  | Improved Unarmed Strike    | 1d6 damage                          |
|     3 | Hunter 2                   | Precise Companion Outflank | +4 Flanking, AO from ally when Crit |
|     3 |                            | Paired Opportunist         | +4 AO, AO when AO from ally         |
|     4 | Hunter Bonus Teamwork Feat |                            |                                     |
|     5 |                            |                            |                                     |
|     7 |                            |                            |                                     |
|     7 | Hunter Bonus Teamwork Feat |                            |                                     |
|     9 |                            |                            |                                     |
|    10 | Hunter Bonus Teamwork Feat |                            |                                     |
** Trait
- Indomitable Faith: +1 Will
- Threatening Defender: +1 Attack when using combat expertise

* Items
| Name                           | Price | Weight | Comment    |
|--------------------------------+-------+--------+------------|
| Agile Breastplate              |   550 |     25 |            |
| +1 Cloak of Resistance         |  1000 |      1 |            |
| Mwk Falchion                   |   375 |      8 |            |
| MWK Longbow, Composite(+4 str) |   800 |      3 |            |
| Arrow(20)                      |     1 |      3 |            |
| Heavy Wooden Shield (Carry)    |     7 |     10 |            |
|--------------------------------+-------+--------+------------|
| Daily Equipment                |       |        |            |
| Water Skin                     |     1 |      4 |            |
| Rope, Silk                     |    10 |      5 |            |
| Whistle,Signal                 |       |        |            |
| Animal Feed, Carnivore(5day)   |       |     25 |            |
| Rations (5day)                 |       |      5 |            |
| Bed Roll                       |       |      5 |            |
| Blanket                        |       |      3 |            |
| Outfit, Traveler's             |     1 |      5 |            |
| Backpack, Masterwork           |    50 |      4 |            |
| Pouch, Belt                    |     1 |    0.5 |            |
|--------------------------------+-------+--------+------------|
| Animal                         |       |        |            |
| Barding, MWK Studded Leather   |   200 |     25 | For Animal |
|--------------------------------+-------+--------+------------|
| Total                          |  2996 |  131.5 |            |
#+TBLFM: @21$2=vsum(@2..@20)::@21$3=vsum(@2..@20)

- Carrying Capacity: 
  - Light: 116lbs (masterwork backpack +1 str for carrying capacity)
  - Animal Carrying Capacity: 66lbs
* Spells
| Lv | Total | Class | Wis Modifier |
|----+-------+-------+--------------|
|  0 |   Inf |   Inf |              |
|  1 |     3 |     2 |            1 |
Spells Knows:
- Level 0 (DC = 11)
  - Create Water
  - Detect Poison
  - Enhanced Diplomacy
  - Known Direction
  - Stabilize
- Level 1 (DC = 12)
  - Cheetah's Sprint
  - Faerie Fire
  - Resist Energy
  - Summon Natural Ally I (auto include)

* Animal Companion: Tyrannosaurus
** Basics 
|     | Attr | Modifier |
|-----+------+----------|
| STR |   15 |        2 |
| DEX |   17 |        3 |
| CON |   10 |        0 |
| INT |    2 |       -4 |
| WIS |   15 |        2 |
| CHA |   10 |        0 |

- HP: 3d8 = 13
- Speed: 30ft
- Init: +3(dex)

** Offense
Bite: +4=+2(BAB)+2(STR), 1d8+3/20x2

** Defense
- AC: 22 = 10 + 3(dex) + 6(natural armor)+3(armor), FF: 19, Touch: 13
- CMD: 10 +2(str) + 3(dex) + 2(BAB) = 17, FF CMD: 14
- Saving Throws
|        | Total | Base | Attribute | Item |
|--------+-------+------+-----------+------|
| Fort   |     3 |    3 |         0 |      |
| Reflex |     6 |    3 |         3 |      |
| Will   |     1 |    1 |         0 |      |
** Skills

| Name        | Total | Attribute | Rank | Misc | Comment                                          |
|-------------+-------+-----------+------+------+--------------------------------------------------|
| Perception* |     7 | Wis 2     |    2 |    3 | +4 With Falcon Focus, +2 when adjacent to hunter |
| Stealth     |     7 | Dex 3     |    1 |    3 |                                                  |

** Feats and Special Qualities
|            Level | Feat          | Description                                        |
|                1 | Combat Reflex |                                                    |
|                2 | Bodyguard     |                                                    |
|           Hunter | Outflank      | +4 When flank                                      |
| Shared Vigilance | Alertness     | +2 Perception/Sense Motive when adjacent to hunter |
|                5 |               |                                                    |
|                8 |               |                                                    |
|               10 |               |                                                    |
- Link: A hunter can handle her animal companion as a free action, or push it as a move action. The hunter gains a +4 circumstance bonus on all wild empathy checks and Handle Animal checks made regarding an animal companion.
- Shared Vigilance: A bodyguard and its master both gain Alertness as a bonus feat whenever they are adjacent.
- Tenacious Guardian:
  - A bodyguard can always act in a surprise round (though it remains flat-footed until it acts).
  - As long as its master is adjacent, a bodyguard remains conscious (though it becomes staggered) when its hit points fall below 0. While below 0 hit points, the bodyguard loses 1 hit point per round but gains a +2 morale bonus on attack rolls, saving throws, and skill checks, dying only if its hit points reach a negative total equal to its Constitution score plus its master's class level (13).

** Tricks 
- Attack all creature (2 tricks): The animal attacks apparent enemies. You may point to a particular creature that you wish the animal to attack, and it will comply if able.
- Down: The animal breaks off from combat or otherwise backs down.
- Come: The animal comes to you, even if it normally would not do so.
- Defend: The animal defends you (or is ready to defend you if no threat is present), even without any command being given. Alternatively, you can command the animal to defend a specific other character.
- Aid: The animal can use the aid another action to aid a specific ally in combat by attacking a specific foe the ally is fighting.
- Heel: The animal follows you closely, even to places where it normally wouldn’t go.

*** Hunter's Trick (3/Day)
An animal companion can use a hunter's trick = HD/2+Wis Mod per day
- Rattling Strike (Ex): The Animal Companion can use this trick as a free action before it makes a melee attack. If the attack hits, the target is shaken for 1d4 rounds.
